# Тема: Робота зі строками и тип данних  Integer (Ціле число)

# Робота з цілими числами.


# print(100+200)
# + - це оператор додавання чисел

# Різниця чисел
# print(500-400)
# "-" - це оператор для знаходження рызниці

# Множення
# * - це оператор для множення чисел.
# print(25*5)

# Ділення
# print(100/5)
# / - це оператор для ділення чисел
# При спробі ділити на ноль, вийде помилка.
# Після ділення результат завжди
# виходить в формате вещественних чисел

# Зберігання чисел в змінних
# number1 = 100
# number2 = 150
# # 1 Віріант
# print(number1+number2)
# # 2 Варіант
# rusult = number1 + number2 #результат зберігаємо в іншу змінну
# print(rusult)

# Підняття в степінь
# Використовується оператор - **

# result = 5 ** 2
# print(result)
# print(2**10)

# Робота з вещественними числами
# Приклад: 0.5, 100.50, 5.125, 3.2

# Взаємодія з вещественими числами проходить
# точно так як і з цілими числами

# print(0.5 + 2.6)
# print(9.6 - 15.6)
# print(5 * 0.5)
# print(10 / 5.5)

# Будь яке=а взаємодія цілого і вещественого числа дає 
# в результаті веществене число.
# Приклад:
# print(2.5 - 0.5)

# Вещественниє числа в Python називаються float
# float - це числовий тип данних Python.

# Робота зі строками.
# age = 19
# text = "I am " + str(age) + " years old."
# print(text)
# str() - команда для перевода данних в строку.

# Форматування строк
#  Варіант 1
# f строка (ф строка)
# name = "John" 
# text = f"My name is {name}"
# print(text)

# age =25
# text2 = f"I am {age} years old."
# print(text2)

# Варіант 2 для форматування
# використовувати метод formating
# age = 30

# text = "I am {} years old".format(age)
# print(text)

# name = "Askar"
# text2 = "I am {}. I am {} years old.".format(name, age)
# print(text2)

# Зріз строк
# Строки мають індекси.
# Позитивні починаються з 0.
# Відємні починаються з -1
# Кожен символ в строці мають свій індекс в залежності від положння в строці.

# product = "Apple"
# print(product[0])
# print(product[-1])
# print(product[4])

# Pineapple
# product = "Pineapple"

# Конкантенація зі зрізами
# print(product[0]+product[3]+product[2])

# Складний зріз
# print(product[4:9])

# Завдання 1)
# Отримати через input імя користувача і фамілію користувача
# Використовуйте два input функцию
# Завдання: Вивести на екран привітання з першим імя фамілії і повне імя
# Приклад виводу: Привіт, S. Olexandr

# name1 = input ("Введіть Ваша імя: ")
# name2 = input ("Введіть Ваше прізвище: ")
# text = f"Привіт {name1[0]}. {name2}, Я ТЕБЕ ЛЮБЛЮ"
# print(text)

# Завдання 2)
# Є змінна з рандомними словами. Завдання із допомогою зрізу створити їз них речення

# text = "like I fottboll play"
# print(text[5] + " " + text[0:4] + " " + text[7:15] + " " + text[16:20])




