# Кортежи - це стандартний тип даних в Python.

# Кортеж це список, але не змінювальний. Його неможливо змінити, 
# в кортеж неможливо додати новий елемент або видалити старий.
# Кортеж по англійськи називається tuple

seasons = ("Spring", "Summer", "Fall", "Winter")
# Кортеж використовується, якщо нам потрібнл створити список коннстант.

# Функціонал кортежу абсолютно ідентичний з функціоналом списків (list)

# Ми можемо перебоати кортеж
# for s in seasons:
#     print(s)
# # Зрі кортежу також можливий
# print(seasons[1:3])

# # Дізнатися індекс можемо чероз метод .index
# print(seasons.index("Fall"))

# # Ми можемо дізнатися кількість визначених елементів через .count
# print(seasons.count("Summer"))


# Завдання для вирішення через for і range
# Користувач вводить(input) сумму, яку  хоче покласти
# в банк в депозит під 10% річних.
# Завдання порахувати скільки грошей накопичеться в кінці,
# коли користувач отримає гроші.

user_sum = int(input("Введіть суму депозиту: "))
years = int(input("Введіть кількість років: "))
percent = int(input("Введіть відсоток: "))
for i in range (1, years+1):
    deposit = user_sum*10 /100
    user_sum = user_sum+deposit
print(f"Всього накопичено: {user_sum}")